
LSTM Shuffled Model Summary:
Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_2 (LSTM)               (None, 10, 64)            41984     
                                                                 
 lstm_3 (LSTM)               (None, 10, 96)            61824     
                                                                 
 lstm_4 (LSTM)               (None, 224)               287616    
                                                                 
 dense_2 (Dense)             (None, 128)               28800     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_3 (Dense)             (None, 7)                 903       
                                                                 
=================================================================
Total params: 421,127
Trainable params: 421,127
Non-trainable params: 0
_________________________________________________________________

LSTM Shuffled Training History:
loss: [1.8463947772979736, 1.6951590776443481, 1.5616899728775024, 1.426517128944397, 1.297076940536499, 1.1703122854232788, 1.0595158338546753, 0.9587830901145935, 0.8778170943260193, 0.8056789040565491, 0.741917073726654, 0.6828840970993042, 0.6350457668304443, 0.5951025485992432, 0.5599579811096191, 0.523855984210968, 0.495556503534317, 0.4675449728965759, 0.44596487283706665, 0.42495760321617126, 0.4059086740016937, 0.3879282772541046, 0.3704121708869934, 0.35580751299858093, 0.34353843331336975, 0.33293139934539795, 0.32178035378456116, 0.309062123298645, 0.30319318175315857, 0.2920958399772644, 0.2837687134742737, 0.2770269811153412, 0.26624131202697754, 0.2642914652824402, 0.25700870156288147, 0.25142014026641846, 0.24492953717708588, 0.2402612417936325, 0.2340550273656845, 0.2313552051782608, 0.22530509531497955, 0.22322502732276917]
accuracy: [0.24416287243366241, 0.3332122266292572, 0.397326797246933, 0.45974573493003845, 0.5176559090614319, 0.5713347792625427, 0.6173129081726074, 0.6585478186607361, 0.6903824210166931, 0.7190640568733215, 0.7449169158935547, 0.7689765095710754, 0.7857924103736877, 0.8018152117729187, 0.815485954284668, 0.8282815217971802, 0.8395025730133057, 0.849774181842804, 0.8579906821250916, 0.8652968406677246, 0.8721654415130615, 0.8786745667457581, 0.8846054673194885, 0.8904777765274048, 0.8945606350898743, 0.8979558348655701, 0.9024801850318909, 0.9071178436279297, 0.9087314605712891, 0.9127283692359924, 0.9157367944717407, 0.9180145859718323, 0.9212222695350647, 0.9224803447723389, 0.9246721863746643, 0.9265124201774597, 0.928688645362854, 0.9307476282119751, 0.9329277873039246, 0.9335333704948425, 0.9359948039054871, 0.9358854293823242]
val_loss: [1.7392879724502563, 1.6223491430282593, 1.511167049407959, 1.35072922706604, 1.226733684539795, 1.1013540029525757, 1.0301319360733032, 0.9863637089729309, 0.9054899215698242, 0.842016875743866, 0.8049820065498352, 0.7625150680541992, 0.7290122509002686, 0.7352800369262695, 0.6635873317718506, 0.619753897190094, 0.6734569072723389, 0.616523265838623, 0.5809917449951172, 0.5486671924591064, 0.5287138223648071, 0.5673209428787231, 0.5191164016723633, 0.5558323264122009, 0.5541937947273254, 0.46525639295578003, 0.4817136228084564, 0.47967690229415894, 0.4467988610267639, 0.44039565324783325, 0.42967912554740906, 0.4072502851486206, 0.48360544443130493, 0.4678604304790497, 0.42971092462539673, 0.4453696608543396, 0.47794580459594727, 0.475299209356308, 0.46661680936813354, 0.42671844363212585, 0.4191637635231018, 0.4559563100337982]
val_accuracy: [0.311678946018219, 0.3650825619697571, 0.4161432385444641, 0.4894569516181946, 0.5438268780708313, 0.5978139042854309, 0.627560555934906, 0.6465863585472107, 0.6809003353118896, 0.706252932548523, 0.7227535247802734, 0.7403936386108398, 0.755353569984436, 0.7553809285163879, 0.7823379635810852, 0.7975531816482544, 0.7816268801689148, 0.8044998049736023, 0.814828634262085, 0.8261329531669617, 0.8332345485687256, 0.8229513168334961, 0.8417948484420776, 0.8284575939178467, 0.8302717804908752, 0.8604833483695984, 0.8561713099479675, 0.8566179871559143, 0.8679679036140442, 0.8718423247337341, 0.8727448582649231, 0.8831465840339661, 0.8590338230133057, 0.8629721403121948, 0.8777588605880737, 0.8713318109512329, 0.8620696067810059, 0.8633094429969788, 0.8683325052261353, 0.8810316324234009, 0.8829551339149475, 0.8736473321914673]

LSTM Shuffled Tuning Information:
Hyperparameters: {'num_lstm_layers': 3, 'lstm_units_0': 64, 'dense_units': 128, 'l1_reg': 1.199898645030084e-05, 'l2_reg': 0.00024355157961146942, 'dropout': 0.4, 'optimizer': 'adam', 'learning_rate': 0.0007781436518320102, 'lstm_units_1': 96, 'lstm_units_2': 224, 'lstm_units_3': 192, 'tuner/epochs': 10, 'tuner/initial_epoch': 4, 'tuner/bracket': 1, 'tuner/round': 1, 'tuner/trial_id': '0018'}
Score: 0.6975832581520081
