
LSTM Shuffled Model Summary:
Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_2 (LSTM)               (None, 10, 64)            41984     
                                                                 
 lstm_3 (LSTM)               (None, 10, 96)            61824     
                                                                 
 lstm_4 (LSTM)               (None, 224)               287616    
                                                                 
 dense_2 (Dense)             (None, 128)               28800     
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_3 (Dense)             (None, 7)                 903       
                                                                 
=================================================================
Total params: 421,127
Trainable params: 421,127
Non-trainable params: 0
_________________________________________________________________

LSTM Shuffled Training History:
loss: [1.8463947772979736, 1.6951590776443481, 1.5616899728775024, 1.426517128944397, 1.297076940536499, 1.1703122854232788, 1.0595158338546753, 0.9587830901145935, 0.8778170943260193, 0.8056789040565491, 0.741917073726654, 0.6828840970993042, 0.6350457668304443, 0.5951025485992432, 0.5599579811096191, 0.523855984210968, 0.495556503534317, 0.4675449728965759, 0.44596487283706665, 0.42495760321617126, 0.4059086740016937, 0.3879282772541046, 0.3704121708869934, 0.35580751299858093, 0.34353843331336975, 0.33293139934539795, 0.32178035378456116, 0.309062123298645, 0.30319318175315857, 0.2920958399772644, 0.2837687134742737, 0.2770269811153412, 0.26624131202697754, 0.2642914652824402, 0.25700870156288147, 0.25142014026641846, 0.24492953717708588, 0.2402612417936325, 0.2340550273656845, 0.2313552051782608, 0.22530509531497955, 0.22322502732276917]
accuracy: [0.24416287243366241, 0.3332122266292572, 0.397326797246933, 0.45974573493003845, 0.5176559090614319, 0.5713347792625427, 0.6173129081726074, 0.6585478186607361, 0.6903824210166931, 0.7190640568733215, 0.7449169158935547, 0.7689765095710754, 0.7857924103736877, 0.8018152117729187, 0.815485954284668, 0.8282815217971802, 0.8395025730133057, 0.849774181842804, 0.8579906821250916, 0.8652968406677246, 0.8721654415130615, 0.8786745667457581, 0.8846054673194885, 0.8904777765274048, 0.8945606350898743, 0.8979558348655701, 0.9024801850318909, 0.9071178436279297, 0.9087314605712891, 0.9127283692359924, 0.9157367944717407, 0.9180145859718323, 0.9212222695350647, 0.9224803447723389, 0.9246721863746643, 0.9265124201774597, 0.928688645362854, 0.9307476282119751, 0.9329277873039246, 0.9335333704948425, 0.9359948039054871, 0.9358854293823242]
val_loss: [1.7392879724502563, 1.6223491430282593, 1.511167049407959, 1.35072922706604, 1.226733684539795, 1.1013540029525757, 1.0301319360733032, 0.9863637089729309, 0.9054899215698242, 0.842016875743866, 0.8049820065498352, 0.7625150680541992, 0.7290122509002686, 0.7352800369262695, 0.6635873317718506, 0.619753897190094, 0.6734569072723389, 0.616523265838623, 0.5809917449951172, 0.5486671924591064, 0.5287138223648071, 0.5673209428787231, 0.5191164016723633, 0.5558323264122009, 0.5541937947273254, 0.46525639295578003, 0.4817136228084564, 0.47967690229415894, 0.4467988610267639, 0.44039565324783325, 0.42967912554740906, 0.4072502851486206, 0.48360544443130493, 0.4678604304790497, 0.42971092462539673, 0.4453696608543396, 0.47794580459594727, 0.475299209356308, 0.46661680936813354, 0.42671844363212585, 0.4191637635231018, 0.4559563100337982]
val_accuracy: [0.311678946018219, 0.3650825619697571, 0.4161432385444641, 0.4894569516181946, 0.5438268780708313, 0.5978139042854309, 0.627560555934906, 0.6465863585472107, 0.6809003353118896, 0.706252932548523, 0.7227535247802734, 0.7403936386108398, 0.755353569984436, 0.7553809285163879, 0.7823379635810852, 0.7975531816482544, 0.7816268801689148, 0.8044998049736023, 0.814828634262085, 0.8261329531669617, 0.8332345485687256, 0.8229513168334961, 0.8417948484420776, 0.8284575939178467, 0.8302717804908752, 0.8604833483695984, 0.8561713099479675, 0.8566179871559143, 0.8679679036140442, 0.8718423247337341, 0.8727448582649231, 0.8831465840339661, 0.8590338230133057, 0.8629721403121948, 0.8777588605880737, 0.8713318109512329, 0.8620696067810059, 0.8633094429969788, 0.8683325052261353, 0.8810316324234009, 0.8829551339149475, 0.8736473321914673]

LSTM Shuffled Tuning Information:
Hyperparameters: {'num_lstm_layers': 3, 'lstm_units_0': 64, 'dense_units': 128, 'l1_reg': 1.199898645030084e-05, 'l2_reg': 0.00024355157961146942, 'dropout': 0.4, 'optimizer': 'adam', 'learning_rate': 0.0007781436518320102, 'lstm_units_1': 96, 'lstm_units_2': 224, 'lstm_units_3': 192, 'tuner/epochs': 10, 'tuner/initial_epoch': 4, 'tuner/bracket': 1, 'tuner/round': 1, 'tuner/trial_id': '0018'}
Score: 0.6975832581520081

RLR LSTM Model Summary:
Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_2 (LSTM)               (None, 10, 256)           364544    
                                                                 
 dropout_3 (Dropout)         (None, 10, 256)           0         
                                                                 
 lstm_3 (LSTM)               (None, 192)               344832    
                                                                 
 dropout_4 (Dropout)         (None, 192)               0         
                                                                 
 dense_2 (Dense)             (None, 160)               30880     
                                                                 
 dropout_5 (Dropout)         (None, 160)               0         
                                                                 
 dense_3 (Dense)             (None, 7)                 1127      
                                                                 
=================================================================
Total params: 741,383
Trainable params: 741,383
Non-trainable params: 0
_________________________________________________________________

RLR LSTM Training History:
loss: [1.9574437141418457, 1.8310459852218628, 1.7642786502838135, 1.7027842998504639, 1.6446515321731567, 1.5830003023147583, 1.5289942026138306, 1.4775331020355225, 1.4311259984970093, 1.3841954469680786, 1.3392515182495117, 1.2963402271270752, 1.2580353021621704, 1.2204865217208862, 1.1844961643218994, 1.152673602104187, 1.119665265083313, 1.0915420055389404, 1.0639724731445312, 1.0382753610610962, 1.0147866010665894, 0.9943044185638428, 0.9726625084877014, 0.9531508088111877, 0.9341540932655334, 0.916044294834137, 0.8995205163955688, 0.8854267001152039, 0.8692867159843445, 0.852882981300354, 0.8400424718856812, 0.8233360648155212, 0.8130031824111938, 0.802668035030365, 0.7913280129432678, 0.7790625691413879, 0.7683753967285156, 0.7595343589782715, 0.7478411793708801, 0.7392217516899109, 0.7321816086769104, 0.722687840461731, 0.7149485945701599, 0.7059866189956665, 0.6987469792366028, 0.693537712097168, 0.6845089197158813, 0.6804616451263428, 0.673768162727356, 0.6683520674705505, 0.6614481210708618, 0.6532935500144958, 0.6511036157608032, 0.6462299823760986, 0.6392694115638733, 0.6331260204315186, 0.6256198287010193, 0.6230387091636658, 0.6177953481674194, 0.6127879023551941, 0.608475923538208, 0.6074892282485962, 0.6001413464546204, 0.5984696745872498, 0.5930195450782776, 0.5877816677093506, 0.5855237245559692, 0.581641674041748, 0.5786833763122559, 0.574099600315094, 0.5694466233253479, 0.5663539171218872, 0.5605056881904602, 0.5586518049240112, 0.5580925941467285, 0.5541249513626099, 0.5542040467262268, 0.5501459240913391, 0.5448490977287292, 0.5423864126205444, 0.5402172207832336, 0.536498486995697, 0.5379247069358826, 0.5365241765975952, 0.5319604873657227, 0.5294833183288574, 0.528785228729248, 0.5233874320983887, 0.5263753533363342, 0.5230540633201599, 0.5198899507522583, 0.5204888582229614, 0.5178641080856323, 0.5178070068359375]
accuracy: [0.22144731879234314, 0.2926805317401886, 0.33176660537719727, 0.36417943239212036, 0.39507633447647095, 0.4260709285736084, 0.4529787302017212, 0.478983998298645, 0.5016526579856873, 0.5228913426399231, 0.5432118773460388, 0.5639426708221436, 0.5795943140983582, 0.5960273146629333, 0.611495316028595, 0.6251856088638306, 0.6382820010185242, 0.64999920129776, 0.6618766188621521, 0.6712496280670166, 0.6812164783477783, 0.6909880042076111, 0.6983840465545654, 0.7076437473297119, 0.7136214971542358, 0.7211230397224426, 0.7285346984863281, 0.7339029908180237, 0.7397518157958984, 0.7456983327865601, 0.7507931590080261, 0.7567083835601807, 0.76107257604599, 0.765882134437561, 0.7697813510894775, 0.7740048766136169, 0.7781150937080383, 0.7812133431434631, 0.7867574691772461, 0.7890704274177551, 0.7913521528244019, 0.7960875034332275, 0.7986348867416382, 0.8018933534622192, 0.8040969371795654, 0.8056246042251587, 0.8091760873794556, 0.811676561832428, 0.8135207295417786, 0.815825879573822, 0.8180763125419617, 0.8205260634422302, 0.821619987487793, 0.8239134550094604, 0.8259294629096985, 0.8276759386062622, 0.829930305480957, 0.8314735889434814, 0.8330051302909851, 0.8345054388046265, 0.837037205696106, 0.8372012972831726, 0.8395299315452576, 0.8402019143104553, 0.8417491316795349, 0.8434056639671326, 0.8450583815574646, 0.8456991314888, 0.8472150564193726, 0.8490630984306335, 0.8500046730041504, 0.8510127067565918, 0.8527708649635315, 0.8537359237670898, 0.8531928062438965, 0.8554745316505432, 0.8554940819740295, 0.8560684323310852, 0.857572615146637, 0.8590729236602783, 0.85987389087677, 0.860522449016571, 0.8597644567489624, 0.8614015579223633, 0.862452507019043, 0.8637145161628723, 0.8629878163337708, 0.8650429248809814, 0.8652108907699585, 0.8654804825782776, 0.8667815327644348, 0.8666994571685791, 0.8672855496406555, 0.868082582950592]
val_loss: [1.8741295337677002, 1.775089144706726, 1.694775938987732, 1.6654192209243774, 1.6288938522338867, 1.5890218019485474, 1.4625582695007324, 1.4727938175201416, 1.3815268278121948, 1.327647089958191, 1.3272616863250732, 1.2373775243759155, 1.19937264919281, 1.2017651796340942, 1.207125186920166, 1.160223126411438, 1.132847785949707, 1.087304711341858, 1.044147253036499, 1.0444958209991455, 1.0272308588027954, 1.0182925462722778, 1.0172184705734253, 0.9552056193351746, 0.9848633408546448, 0.937728762626648, 0.9045298099517822, 0.9473397731781006, 0.8598269820213318, 0.8791934251785278, 0.831380307674408, 0.8692807555198669, 0.8589601516723633, 0.8182043433189392, 0.8027148246765137, 0.7958102226257324, 0.8762519955635071, 0.792571485042572, 0.8264855742454529, 0.7883245944976807, 0.7876953482627869, 0.7594112157821655, 0.7747040390968323, 0.7685209512710571, 0.7884690165519714, 0.7495509386062622, 0.7420881390571594, 0.7216182947158813, 0.7072806358337402, 0.7021954655647278, 0.735783040523529, 0.7245228290557861, 0.7324461936950684, 0.700533390045166, 0.753871500492096, 0.7066071033477783, 0.7664356231689453, 0.7029057145118713, 0.6596202850341797, 0.7077981233596802, 0.6493756771087646, 0.6981652975082397, 0.679282546043396, 0.7101464867591858, 0.655279278755188, 0.6805250644683838, 0.6599342226982117, 0.698617696762085, 0.6367273330688477, 0.638920783996582, 0.6371307969093323, 0.6445311903953552, 0.6807984709739685, 0.6586960554122925, 0.678337574005127, 0.6132479310035706, 0.6596588492393494, 0.6976011991500854, 0.6193219423294067, 0.6496819257736206, 0.65175861120224, 0.6120077967643738, 0.6100324988365173, 0.5938653349876404, 0.6065507531166077, 0.6351954936981201, 0.6619777083396912, 0.6181179881095886, 0.6152586340904236, 0.7021971344947815, 0.6275652647018433, 0.6026124954223633, 0.6176275610923767, 0.6381554007530212]
val_accuracy: [0.25333431363105774, 0.32731351256370544, 0.36423471570014954, 0.3760039508342743, 0.40510332584381104, 0.4180667996406555, 0.47870877385139465, 0.4783441126346588, 0.519039511680603, 0.5403079390525818, 0.5461241602897644, 0.5812038779258728, 0.5965284705162048, 0.6027367115020752, 0.6061644554138184, 0.6176328659057617, 0.6335591077804565, 0.6465499401092529, 0.6662321090698242, 0.6679277420043945, 0.677436113357544, 0.6808638572692871, 0.6860784292221069, 0.7034541964530945, 0.700090229511261, 0.713245153427124, 0.7267646789550781, 0.7113671898841858, 0.7450429797172546, 0.738506555557251, 0.7550709843635559, 0.7444139719009399, 0.7493732571601868, 0.7638226747512817, 0.7665484547615051, 0.7732033729553223, 0.7466930150985718, 0.7731122374534607, 0.7700126767158508, 0.7776157259941101, 0.7779074311256409, 0.7880356907844543, 0.7825385332107544, 0.7844529747962952, 0.7848541140556335, 0.7938975095748901, 0.7954381704330444, 0.8001604676246643, 0.8068792223930359, 0.810698926448822, 0.799267053604126, 0.8030503392219543, 0.8030412197113037, 0.810954213142395, 0.7982642650604248, 0.8125039935112, 0.7984921336174011, 0.8126133680343628, 0.8264064192771912, 0.8095594048500061, 0.8302353024482727, 0.8135432600975037, 0.8211736679077148, 0.8170986175537109, 0.8251210451126099, 0.8242822885513306, 0.8290775418281555, 0.8164422512054443, 0.8353860378265381, 0.8349028825759888, 0.8359056711196899, 0.8338544964790344, 0.8243370056152344, 0.8327149152755737, 0.8252395391464233, 0.8419771790504456, 0.835003137588501, 0.8158679008483887, 0.8415486812591553, 0.8334989547729492, 0.8339000940322876, 0.847282886505127, 0.8475472331047058, 0.8493431806564331, 0.847902774810791, 0.8402359485626221, 0.8339365124702454, 0.8462071418762207, 0.8443109393119812, 0.8286125659942627, 0.8448305726051331, 0.8516131639480591, 0.8468999862670898, 0.8426061868667603]
lr: [0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736, 0.00044012736]

RLR LSTM Tuning Information:
Hyperparameters: {'num_lstm_layers': 2, 'lstm_units_0': 256, 'dropout': 0.30000000000000004, 'dense_units': 160, 'l1_reg': 0.0010898427617324405, 'l2_reg': 2.9671375213130146e-05, 'optimizer': 'rmsprop', 'learning_rate': 0.0004401273755211673, 'clipvalue': 0.03868251538336863, 'lstm_units_1': 192, 'lstm_units_2': 64, 'tuner/epochs': 10, 'tuner/initial_epoch': 0, 'tuner/bracket': 0, 'tuner/round': 0}
Score: 0.5274903774261475

bilstm_2 Model Summary:
Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 bidirectional_2 (Bidirectio  (None, 10, 192)          150528    
 nal)                                                            
                                                                 
 bidirectional_3 (Bidirectio  (None, 10, 320)          451840    
 nal)                                                            
                                                                 
 bidirectional_4 (Bidirectio  (None, 384)              787968    
 nal)                                                            
                                                                 
 dense_2 (Dense)             (None, 224)               86240     
                                                                 
 dropout_1 (Dropout)         (None, 224)               0         
                                                                 
 dense_3 (Dense)             (None, 7)                 1575      
                                                                 
=================================================================
Total params: 1,478,151
Trainable params: 1,478,151
Non-trainable params: 0
_________________________________________________________________

bilstm_2 Training History:
loss: [1.7552335262298584, 1.5663505792617798, 1.3931050300598145, 1.218407154083252, 1.0640480518341064, 0.9312043190002441, 0.8159278035163879, 0.7207179069519043, 0.6385429501533508, 0.5713289380073547, 0.5140848755836487, 0.466788113117218, 0.42483729124069214, 0.3872549533843994, 0.35557058453559875, 0.3283061981201172, 0.30296632647514343, 0.28651052713394165, 0.2624853849411011, 0.24696144461631775, 0.23533104360103607, 0.21826431155204773, 0.20580457150936127, 0.1941773146390915, 0.1857968270778656, 0.17740650475025177, 0.16821372509002686, 0.1609293520450592, 0.15188491344451904, 0.14439824223518372, 0.14306659996509552, 0.1371529996395111, 0.13158395886421204, 0.12662473320960999, 0.12337962538003922, 0.11883734911680222, 0.11446486413478851, 0.10955091565847397, 0.10908737778663635, 0.10410460829734802, 0.02175121381878853, 0.012775869108736515, 0.01039134245365858, 0.00940458569675684, 0.008989809080958366, 0.008472500368952751, 0.008008154109120369, 0.007893878035247326, 0.002027516718953848, 0.0011252681724727154, 0.0008697211742401123, 0.0007807228830642998, 0.000632404291536659, 0.0006045668851584196, 0.0005947400932200253, 0.0004115093033760786]
accuracy: [0.2908090651035309, 0.3864300549030304, 0.4643990099430084, 0.539054811000824, 0.6030170321464539, 0.6567193269729614, 0.7024434804916382, 0.7389391660690308, 0.7709574103355408, 0.7957514524459839, 0.8172597289085388, 0.8344624638557434, 0.8503602147102356, 0.8642107248306274, 0.8756192922592163, 0.885953426361084, 0.8951700925827026, 0.9006595015525818, 0.9086142778396606, 0.9148576855659485, 0.9188897609710693, 0.9249652028083801, 0.9291965365409851, 0.9340139627456665, 0.9359284043312073, 0.9391790628433228, 0.9421093463897705, 0.9453873634338379, 0.9479659795761108, 0.9510447382926941, 0.9518535137176514, 0.9536976218223572, 0.9560027718544006, 0.9573663473129272, 0.9582571387290955, 0.9598433971405029, 0.9614296555519104, 0.9627971053123474, 0.9633402228355408, 0.9650006890296936, 0.9934869408607483, 0.9962297081947327, 0.9967923164367676, 0.997022807598114, 0.9970853328704834, 0.9972455501556396, 0.9975385665893555, 0.9975697994232178, 0.9994999170303345, 0.9998085498809814, 0.9998476505279541, 0.9998359084129333, 0.9998788833618164, 0.9998906254768372, 0.9998984336853027, 0.9999218583106995]
val_loss: [1.6186374425888062, 1.483577847480774, 1.3347325325012207, 1.1465290784835815, 1.048439621925354, 0.8848317861557007, 0.7776416540145874, 0.7103137969970703, 0.7391353249549866, 0.5943141579627991, 0.5486775636672974, 0.5033088326454163, 0.4623129367828369, 0.4386945962905884, 0.4477967917919159, 0.39962372183799744, 0.3849560618400574, 0.40308481454849243, 0.3783908486366272, 0.4081624746322632, 0.2875902056694031, 0.2846803367137909, 0.31067022681236267, 0.2830025553703308, 0.3058268427848816, 0.2514936923980713, 0.31888681650161743, 0.32796403765678406, 0.2893257737159729, 0.26244381070137024, 0.24323436617851257, 0.24881286919116974, 0.22681626677513123, 0.24375440180301666, 0.2654368281364441, 0.23158416152000427, 0.3499974012374878, 0.2574909031391144, 0.2755652368068695, 0.24896365404129028, 0.14121417701244354, 0.14581239223480225, 0.1606033444404602, 0.14851991832256317, 0.16179326176643372, 0.16303393244743347, 0.15921391546726227, 0.16684213280677795, 0.1484936624765396, 0.15010139346122742, 0.14906592667102814, 0.15526050329208374, 0.15639464557170868, 0.15543201565742493, 0.15901705622673035, 0.16202658414840698]
val_accuracy: [0.36166390776634216, 0.4249860942363739, 0.4923468232154846, 0.5724977850914001, 0.6110052466392517, 0.676296591758728, 0.7213951945304871, 0.7458543181419373, 0.7357534170150757, 0.7938883900642395, 0.8105895519256592, 0.8285031914710999, 0.843645453453064, 0.8510844111442566, 0.850172758102417, 0.8709853887557983, 0.8746501803398132, 0.8689433336257935, 0.8773394823074341, 0.868879497051239, 0.9107053279876709, 0.9130300283432007, 0.9054543375968933, 0.9130938053131104, 0.9061380624771118, 0.9259114265441895, 0.9048252701759338, 0.9025371074676514, 0.9136499166488647, 0.9237508177757263, 0.9287192225456238, 0.9278440475463867, 0.9375256299972534, 0.9301596283912659, 0.9250544905662537, 0.9357935190200806, 0.9006409049034119, 0.9300684928894043, 0.9218181371688843, 0.9318552613258362, 0.9676278233528137, 0.9682386517524719, 0.9658136963844299, 0.9705541729927063, 0.9689861536026001, 0.9689770340919495, 0.9695605039596558, 0.9688767790794373, 0.9737722277641296, 0.9737995862960815, 0.9746474027633667, 0.9731979370117188, 0.9742098450660706, 0.9743739366531372, 0.9739727973937988, 0.9730429649353027]
lr: [0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 0.0002469237, 4.938474e-05, 4.938474e-05, 4.938474e-05, 4.938474e-05, 4.938474e-05, 4.938474e-05, 4.938474e-05, 4.938474e-05, 1e-05, 1e-05, 1e-05, 1e-05, 1e-05, 1e-05, 1e-05, 1e-05]

bilstm_2 Tuning Information:
Hyperparameters: {'num_bilstm_layers': 3, 'lstm_units_0': 96, 'dense_units': 224, 'dropout_dense': 0.2, 'optimizer': 'adam', 'learning_rate': 0.00024692369871809545, 'lstm_units_1': 160, 'lstm_units_2': 192, 'tuner/epochs': 10, 'tuner/initial_epoch': 4, 'tuner/bracket': 2, 'tuner/round': 2, 'tuner/trial_id': '0012'}
Score: 0.7773148715496063
