
Sequential Model Summary:
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 990)               0         
                                                                 
 dense (Dense)               (None, 384)               380544    
                                                                 
 dropout (Dropout)           (None, 384)               0         
                                                                 
 dense_1 (Dense)             (None, 160)               61600     
                                                                 
 dropout_1 (Dropout)         (None, 160)               0         
                                                                 
 dense_2 (Dense)             (None, 64)                10304     
                                                                 
 dropout_2 (Dropout)         (None, 64)                0         
                                                                 
 dense_3 (Dense)             (None, 7)                 455       
                                                                 
=================================================================
Total params: 452,903
Trainable params: 452,903
Non-trainable params: 0
_________________________________________________________________

Sequential Training History:
loss: [1.9083974361419678, 1.8791321516036987, 1.863684058189392, 1.8569806814193726, 1.850743293762207, 1.8468016386032104, 1.8658264875411987, 1.845470905303955, 1.83599054813385, 1.8312300443649292, 1.8299756050109863, 1.8249849081039429, 1.8224645853042603, 1.8202112913131714, 1.8188599348068237, 1.8166131973266602, 1.8160624504089355, 1.814096450805664, 1.8300137519836426, 1.8320475816726685, 1.8307323455810547, 1.829351782798767, 1.8281618356704712, 1.826238751411438]
accuracy: [0.18136106431484222, 0.20780393481254578, 0.2197321355342865, 0.22403378784656525, 0.22683122754096985, 0.2294684797525406, 0.21395361423492432, 0.2329457551240921, 0.2385445535182953, 0.24248284101486206, 0.24197493493556976, 0.24658524990081787, 0.24737446010112762, 0.24966789782047272, 0.2502656877040863, 0.25159406661987305, 0.25132057070732117, 0.2530982792377472, 0.24295169115066528, 0.2414592057466507, 0.2421390265226364, 0.24399878084659576, 0.24308453500270844, 0.24504977464675903]
val_loss: [1.8795562982559204, 1.8655959367752075, 1.8435455560684204, 1.814070463180542, 1.8428174257278442, 1.8175506591796875, 1.851022481918335, 1.8038268089294434, 1.8062198162078857, 1.8034203052520752, 1.7871958017349243, 1.7883352041244507, 1.8074301481246948, 1.796836495399475, 1.8058353662490845, 1.7905311584472656, 1.7855937480926514, 1.7860594987869263, 1.8097752332687378, 1.8024795055389404, 1.8355475664138794, 1.8249614238739014, 1.811180830001831, 1.8138309717178345]
val_accuracy: [0.21388785541057587, 0.22626785933971405, 0.23741716146469116, 0.2582297921180725, 0.23573975265026093, 0.2604268193244934, 0.22991439700126648, 0.27317148447036743, 0.26526761054992676, 0.27249687910079956, 0.28209638595581055, 0.28290775418281555, 0.25719964504241943, 0.2732626497745514, 0.26451095938682556, 0.2764260172843933, 0.278522789478302, 0.28505921363830566, 0.26597869396209717, 0.26892325282096863, 0.24247673153877258, 0.2557319104671478, 0.25876766443252563, 0.26382723450660706]

Sequential Tuning Information:
Hyperparameters: {'num_layers': 3, 'units_0': 384, 'dropout_0': 0.2, 'units_1': 160, 'dropout_1': 0.1, 'units_2': 64, 'dropout_2': 0.1, 'units_3': 320, 'dropout_3': 0.2, 'units_4': 64, 'dropout_4': 0.4, 'tuner/epochs': 10, 'tuner/initial_epoch': 4, 'tuner/bracket': 1, 'tuner/round': 1, 'tuner/trial_id': '0020'}
Score: 0.24191151559352875

Shuffled Model Summary:
Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten_1 (Flatten)         (None, 990)               0         
                                                                 
 dense_5 (Dense)             (None, 224)               221984    
                                                                 
 dropout_4 (Dropout)         (None, 224)               0         
                                                                 
 dense_6 (Dense)             (None, 64)                14400     
                                                                 
 dropout_5 (Dropout)         (None, 64)                0         
                                                                 
 dense_7 (Dense)             (None, 7)                 455       
                                                                 
=================================================================
Total params: 236,839
Trainable params: 236,839
Non-trainable params: 0
_________________________________________________________________

Shuffled Training History:
loss: [1.891994595527649, 1.8455774784088135, 1.8196924924850464, 1.8083975315093994, 1.7962794303894043, 1.7895368337631226, 1.7843838930130005, 1.7773585319519043, 1.7720038890838623, 1.768620252609253, 1.7622216939926147, 1.76039457321167, 1.7571806907653809, 1.7551108598709106, 1.751067876815796, 1.7504425048828125, 1.747912049293518, 1.746489405632019, 1.7464954853057861, 1.7441524267196655, 1.7433711290359497, 1.742095708847046, 1.7392761707305908, 1.7386075258255005, 1.7372151613235474, 1.7370009422302246, 1.7356480360031128, 1.735217571258545, 1.7344744205474854, 1.7342888116836548, 1.7325279712677002, 1.7331687211990356, 1.7311952114105225, 1.730538010597229, 1.7298846244812012, 1.7291897535324097, 1.7285677194595337, 1.7291280031204224, 1.727419376373291, 1.72696053981781, 1.727311134338379, 1.7252297401428223, 1.7261031866073608, 1.72602117061615, 1.7246264219284058, 1.7242770195007324, 1.7222050428390503, 1.7234727144241333, 1.7225356101989746, 1.7244840860366821, 1.7237502336502075, 1.7234042882919312, 1.7221107482910156, 1.7213746309280396, 1.7231813669204712, 1.7208861112594604, 1.7209343910217285, 1.7186615467071533, 1.7196918725967407, 1.7203627824783325, 1.7198820114135742, 1.7182039022445679, 1.718583583831787, 1.7186287641525269, 1.7192147970199585, 1.7171809673309326, 1.717017650604248, 1.7168291807174683, 1.7171645164489746, 1.7165863513946533, 1.7165342569351196, 1.7164690494537354]
accuracy: [0.19420351088047028, 0.2358604073524475, 0.2542821168899536, 0.26118195056915283, 0.26793333888053894, 0.27195367217063904, 0.2738954722881317, 0.27846282720565796, 0.28138527274131775, 0.2829481065273285, 0.28686296939849854, 0.2881796360015869, 0.28972291946411133, 0.28909388184547424, 0.29233282804489136, 0.29269227385520935, 0.29379406571388245, 0.29465749859809875, 0.29504820704460144, 0.29578274488449097, 0.29510682821273804, 0.2964586615562439, 0.296317994594574, 0.29829496145248413, 0.2980371117591858, 0.29834574460983276, 0.2990685701370239, 0.29813867807388306, 0.30045947432518005, 0.29911935329437256, 0.3007407784461975, 0.2996077239513397, 0.30102208256721497, 0.30215904116630554, 0.3025614619255066, 0.30238956212997437, 0.3015456199645996, 0.30186599493026733, 0.30275681614875793, 0.3034210205078125, 0.304350882768631, 0.30477675795555115, 0.30492913722991943, 0.3043157160282135, 0.3047298789024353, 0.3048783242702484, 0.306304395198822, 0.3052768409252167, 0.3057144284248352, 0.3049760162830353, 0.305183082818985, 0.3053940534591675, 0.3065114915370941, 0.3075820207595825, 0.30498382449150085, 0.306241899728775, 0.3078828454017639, 0.30825793743133545, 0.30753904581069946, 0.3072381913661957, 0.3080039620399475, 0.3092503249645233, 0.30787503719329834, 0.30820322036743164, 0.30748042464256287, 0.3095238208770752, 0.3090822994709015, 0.3097660541534424, 0.30882054567337036, 0.30965274572372437, 0.30987152457237244, 0.3098129332065582]
val_loss: [1.850932240486145, 1.8044685125350952, 1.7838233709335327, 1.7676784992218018, 1.779977560043335, 1.7467143535614014, 1.7522211074829102, 1.7381088733673096, 1.732360601425171, 1.7398898601531982, 1.7288514375686646, 1.714853286743164, 1.742348074913025, 1.7327876091003418, 1.7196509838104248, 1.7037118673324585, 1.7036606073379517, 1.7071666717529297, 1.7369046211242676, 1.7105237245559692, 1.702415943145752, 1.6994796991348267, 1.727068543434143, 1.6895252466201782, 1.7028188705444336, 1.7067493200302124, 1.7012516260147095, 1.6923887729644775, 1.6950799226760864, 1.688578486442566, 1.687097191810608, 1.690633773803711, 1.6871544122695923, 1.6849018335342407, 1.7135580778121948, 1.6980552673339844, 1.675622820854187, 1.676714301109314, 1.6865463256835938, 1.6726622581481934, 1.678435206413269, 1.6724475622177124, 1.6919599771499634, 1.6931771039962769, 1.6787172555923462, 1.6825435161590576, 1.6782233715057373, 1.6717743873596191, 1.6835081577301025, 1.6825549602508545, 1.689826250076294, 1.6734154224395752, 1.6875280141830444, 1.715366244316101, 1.6693307161331177, 1.6895558834075928, 1.6732233762741089, 1.6902145147323608, 1.6808220148086548, 1.6655361652374268, 1.6776241064071655, 1.7006926536560059, 1.6889243125915527, 1.673244595527649, 1.6652097702026367, 1.6952821016311646, 1.6705670356750488, 1.6790562868118286, 1.6822822093963623, 1.66988205909729, 1.7161729335784912, 1.6751278638839722]
val_accuracy: [0.2309536635875702, 0.2633076012134552, 0.2783769369125366, 0.29496869444847107, 0.277957558631897, 0.2958894371986389, 0.29435789585113525, 0.3036656975746155, 0.3076586425304413, 0.30643704533576965, 0.3089258074760437, 0.31503376364707947, 0.30651000142097473, 0.302079439163208, 0.30659204721450806, 0.3205856382846832, 0.31788718700408936, 0.3236578404903412, 0.2959623634815216, 0.31670206785202026, 0.31624624133110046, 0.3258913457393646, 0.3097918629646301, 0.3283892273902893, 0.31763193011283875, 0.32370343804359436, 0.32202601432800293, 0.32309263944625854, 0.3230014741420746, 0.3250252902507782, 0.329519659280777, 0.3230835199356079, 0.32557228207588196, 0.33204489946365356, 0.3130646347999573, 0.3205491602420807, 0.33487096428871155, 0.33736884593963623, 0.32466062903404236, 0.33830782771110535, 0.33405959606170654, 0.334433376789093, 0.33137938380241394, 0.32169783115386963, 0.3347524404525757, 0.33085066080093384, 0.33384081721305847, 0.3357461392879486, 0.33057716488838196, 0.332500696182251, 0.32549023628234863, 0.3386177718639374, 0.3293464481830597, 0.3010948598384857, 0.3366760015487671, 0.3219622075557709, 0.3343239724636078, 0.32849863171577454, 0.3335764408111572, 0.33893686532974243, 0.3333394229412079, 0.32271885871887207, 0.3258913457393646, 0.3341507613658905, 0.33886390924453735, 0.318297415971756, 0.3391100764274597, 0.3344607353210449, 0.33178964257240295, 0.3400946259498596, 0.31348398327827454, 0.33334851264953613]

Shuffled Tuning Information:
Hyperparameters: {'num_layers': 2, 'units_0': 224, 'dropout_0': 0.1, 'units_1': 64, 'dropout_1': 0.1, 'units_2': 512, 'dropout_2': 0.1, 'units_3': 32, 'dropout_3': 0.5, 'tuner/epochs': 10, 'tuner/initial_epoch': 4, 'tuner/bracket': 2, 'tuner/round': 2, 'tuner/trial_id': '0012'}
Score: 0.320877343416214
